lvx/base/InformationRegisters/бит_ОбъектыМобильногоВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ОбъектыМобильногоВизирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ОбъектыМобильногоВизирования/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	УдалитьОбъектСистемы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбъектыВизирования = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОбъектыВизирования);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК ОбъектСистемы,
	|	Таблица.Наименование КАК Синоним
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОбъектыМобильногоВизирования КАК ОбъектыМобильногоВизирования
	|		ПО (ОбъектыМобильногоВизирования.ОбъектСистемы = Таблица.Ссылка)
	|ГДЕ
	|	Таблица.Ссылка В(&Ссылка)
	|	И ОбъектыМобильногоВизирования.ОбъектСистемы ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.бит_ОбъектыМобильногоВизирования.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьОбъектСистемы()
	
	ТекстВопроса = НСтр("ru = 'Удаленные объекты перестанут быть доступны в мобильном приложении. Продолжить?';
	                    |en = 'Deleted items will no longer be available in the mobile app. Continue?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
			УдалитьОбъектСистемыСервер(ВыделенныеСтроки);
			ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_ОбъектыМобильногоВизирования"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьОбъектСистемыСервер(Знач ВыделенныеСтроки)
	
	ОбъектыСистемы = Новый Массив;
	Для Каждого ТекКлючЗаписи Из ВыделенныеСтроки Цикл
		Если НЕ ТекКлючЗаписи.Пустой() Тогда
			ОбъектыСистемы.Добавить(ТекКлючЗаписи.ОбъектСистемы);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыСистемы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ОбъектСистемы КАК ОбъектСистемы
	|ИЗ
	|	РегистрСведений.бит_ОбъектыМобильногоВизирования КАК Таблица
	|ГДЕ
	|	Таблица.ОбъектСистемы В (&ОбъектыСистемы)";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.бит_ОбъектыМобильногоВизирования");
		ЭлементБлокировки.УстановитьЗначение("ОбъектСистемы", Выборка.ОбъектСистемы);
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.бит_ОбъектыМобильногоВизирования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
